Revit 2026 API

# TemperatureRatingTypeSetReverseIterator Method

---

Retrieve a backward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual TemperatureRatingTypeSetIterator ReverseIterator()
```
```vb
Public Overridable Function ReverseIterator As TemperatureRatingTypeSetIterator
```
```cpp
public:
virtual TemperatureRatingTypeSetIterator^ ReverseIterator()
```
```fsharp
abstract ReverseIterator : unit -> TemperatureRatingTypeSetIterator
override ReverseIterator : unit -> TemperatureRatingTypeSetIterator
```

#### Return Value

TemperatureRatingTypeSetIteratorReturns a backward moving iterator to the set.

#### Reference

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace